[net]
batch=128
subdivisions=1
height=28
width=28
channels=3
max_crop=32
min_crop=32

hue=.1
saturation=.75
exposure=.75

learning_rate=0.1
policy=poly
power=4
max_batches = 40000
momentum=0.9
decay=0.0005

[connected]
output=2048
activation=relu

[connected]
output=1024
activation=relu

[connected]
output=512
activation=relu

[connected]
output=10
activation=linear

[softmax]
