[net]
batch=64
subdivisions=1
height=28
width=28
channels=3
max_crop=32
min_crop=32

hue=.1
saturation=.75
exposure=.75

learning_rate=0.025
policy=poly
power=4
max_batches = 60000
momentum=0.9
decay=0.0005

[convolutional]
filters=32
size=3
stride=1
pad=1
activation=relu

[maxpool]
size=2
stride=2

[convolutional]
filters=16
size=1
stride=1
pad=1
activation=relu

[convolutional]
filters=64
size=3
stride=1
pad=1
activation=relu

[maxpool]
size=2
stride=2

[convolutional]
filters=32
size=1
stride=1
pad=1
activation=relu

[convolutional]
filters=128
size=3
stride=1
pad=1
activation=relu

[convolutional]
filters=64
size=1
stride=1
pad=1
activation=relu

[convolutional]
filters=10
size=1
stride=1
pad=1
activation=relu

[avgpool]

[softmax]